windDrivenRainFoam/validation/cubicBuildingWind/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    arch            "LSB;label=32;scalar=64";
    class           volScalarField;
    location        "0";
    object          epsilon;
}

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.0144;

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
        Uref            10;
        Zref            10;
        zDir            ( 0 0 1 );
        flowDir         ( 1 0 0 );
        z0              0.03;
        d               0;
        value           uniform 0.0144;
    }
    outlet
    {
        type            zeroGradient;
    }
    ground
    {
        type            epsilonWallFunction;
        value           uniform 0.0144;
    }
    top
    {
        type            slip;
    }
    sideY1
    {
        type            symmetryPlane;
    }
    sideY2
    {
        type            symmetryPlane;
    }
    oldInternalFaces
    {
        type            empty;
    }
    building
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
