windDrivenRainFoam/validation/cubicBuildingWind/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    catchRatio
    {
        type            surfaces;
        libs            ("libsampling.so");
        writeControl    writeTime;
        surfaceFormat   raw;
        fields          (U p);
        interpolationScheme cellPoint;
        surfaces
        (
            buildingWindward
            {
                type        patch;
                patches     (building);
                // Extract only windward face (x = 0)
                zone        "x = 0";
            }
        );
    }
    
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   100;
        fields          (U p);
        probeLocations
        (
            (-5 5 5)      // Upstream
            (-0.5 5 5)    // Just before building
            (10.5 5 5)    // Just after building
            (15 5 5)      // Downstream
            (5 15 5)      // Beside building
        );
    }
}

// ************************************************************************* //